[IC@IC lab3]$ dc_shell-t | tee -i lab3.log
                                        
                           Design Compiler Graphical 
                                 DC Ultra (TM)
                                  DFTMAX (TM)
                              Power Compiler (TM)
                                 DesignWare (R)
                                 DC Expert (TM)
                               Design Vision (TM)
                               HDL Compiler (TM)
                               VHDL Compiler (TM)
                                  DFT Compiler
                               Design Compiler(R)
                                        
                 Version K-2015.06 for linux64 - May 28, 2015 
                                        
                    Copyright (c) 1988 - 2015 Synopsys, Inc.
   This software and the associated documentation are proprietary to Synopsys,
 Inc. This software may only be used in accordance with the terms and conditions
 of a written license agreement with Synopsys, Inc. All other use, reproduction,
            or distribution of this software is strictly prohibited.
Initializing...
Initializing gui preferences from file  /home/IC/.synopsys_dv_prefs.tcl
dc_shell> source common_setup.tcl 
sc.sdb
dc_shell> source dc_setup.tcl 
sc.sdb
dc_shell> read_verilog rtl/MY_DESIGN.v 
Loading db file '/home/IC/Desktop/DC_labs/ref/libs/mw_lib/sc/LM/sc_max.db'
Loading db file '/opt/Foundary_Library/TSMC90/aci/sc-x/synopsys/fast.db'
Loading db file '/opt/Foundary_Library/TSMC90/aci/sc-x/synopsys/fast_leakage.db'
Loading db file '/opt/Foundary_Library/TSMC90/aci/sc-x/synopsys/fastz.db'
Loading db file '/opt/Foundary_Library/TSMC90/aci/sc-x/synopsys/slow.db'
Loading db file '/opt/Foundary_Library/TSMC90/aci/sc-x/synopsys/typical.db'
Loading db file '/opt/Foundary_Library/TSMC90/aci/sc-x/synopsys/typical_leakage.db'
Loading db file '/opt/Synopsys/Synplify2015/libraries/syn/gtech.db'
Loading db file '/opt/Synopsys/Synplify2015/libraries/syn/standard.sldb'
  Loading link library 'cb13fs120_tsmc_max'
  Loading link library 'fast'
  Loading link library 'fast_leakage'
  Loading link library 'fastz'
  Loading link library 'slow'
  Loading link library 'typical'
  Loading link library 'typical_leakage'
  Loading link library 'gtech'
Loading verilog file '/home/IC/Desktop/DC_labs/lab3/rtl/MY_DESIGN.v'
Detecting input file type automatically (-rtl or -netlist).
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/IC/Desktop/DC_labs/lab3/rtl/MY_DESIGN.v

Inferred memory devices in process
	in routine MY_DESIGN line 13 in file
		'/home/IC/Desktop/DC_labs/lab3/rtl/MY_DESIGN.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|       R4_reg        | Flip-flop |   5   |  Y  | N  | N  | N  | N  | N  | N  |
|       R2_reg        | Flip-flop |   5   |  Y  | N  | N  | N  | N  | N  | N  |
|       R3_reg        | Flip-flop |   5   |  Y  | N  | N  | N  | N  | N  | N  |
|       R1_reg        | Flip-flop |   5   |  Y  | N  | N  | N  | N  | N  | N  |
===============================================================================

Statistics for case statements in always block at line 40 in file
	'/home/IC/Desktop/DC_labs/lab3/rtl/MY_DESIGN.v'
===============================================
|           Line           |  full/ parallel  |
===============================================
|            43            |    auto/auto     |
===============================================
Presto compilation completed successfully.
Current design is now '/home/IC/Desktop/DC_labs/lab3/rtl/MY_DESIGN.db:MY_DESIGN'
Loaded 3 designs.
Current design is 'MY_DESIGN'.
MY_DESIGN ARITH COMBO
dc_shell> source scripts/MY_DESIGN.con 
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Using operating conditions 'cb13fs120_tsmc_max' found in library 'cb13fs120_tsmc_max'.
1
dc_shell> compile_ultra 
Information: Performing power optimization. (PWR-850)
Alib files are up-to-date.
Loading db file '/opt/Synopsys/Synplify2015/libraries/syn/dw_foundation.sldb'
Warning: DesignWare synthetic library dw_foundation.sldb is added to the synthetic_library in the current command. (UISN-40)
Information: Evaluating DesignWare library utilization. (UISN-27)

============================================================================
| DesignWare Building Block Library  |         Version         | Available |
============================================================================
| Basic DW Building Blocks           | K-2015.06-DWBB_201506.0 |     *     |
| Licensed DW Building Blocks        | K-2015.06-DWBB_201506.0 |     *     |
| fast                               | 1.300000                |           |
| fast_leakage                       | 1.300000                |           |
| fastz                              | 1.300000                |           |
| slow                               | 1.300000                |           |
| typical                            | 1.300000                |           |
| typical_leakage                    | 1.300000                |           |
============================================================================

Information: Sequential output inversion is enabled.  SVF file must be used for formal verification. (OPT-1208)

Information: There are 2 potential problems in your design. Please run 'check_design' for more information. (LINT-99)


Loaded alib file './alib-52/sc_max.db.alib'
  Building model 'DW01_NAND2'
Information: Ungrouping hierarchy U1_ARITH before Pass 1 (OPT-776)
Information: Ungrouping hierarchy U_COMBO before Pass 1 (OPT-776)
Information: Ungrouping hierarchy U_COMBO/U2_ARITH before Pass 1 (OPT-776)
Information: Ungrouping 3 of 4 hierarchies before Pass 1 (OPT-775)
Information: State dependent leakage is now switched from on to off.

  Beginning Pass 1 Mapping
  ------------------------
  Processing 'MY_DESIGN'
 Implement Synthetic for 'MY_DESIGN'.
Memory usage for J1 task 347 Mbytes -- main task 347 Mbytes.

  Updating timing information
Information: Updating design information... (UID-85)

  Beginning Mapping Optimizations  (Ultra High effort)
  -------------------------------
Information: Added key list 'DesignWare' to design 'MY_DESIGN'. (DDB-72)
Information: In design 'MY_DESIGN', the register 'R3_reg[0]' is removed because it is merged to 'R1_reg[0]'. (OPT-1215)

  Beginning Constant Register Removal
  -----------------------------------

  Beginning Global Optimizations
  ------------------------------
  Numerical Synthesis (Phase 1)
  Numerical Synthesis (Phase 2)
  Global Optimization (Phase 1)
  Global Optimization (Phase 2)
  Global Optimization (Phase 3)
  Global Optimization (Phase 4)
  Global Optimization (Phase 5)
  Global Optimization (Phase 6)
  Global Optimization (Phase 7)
  Global Optimization (Phase 8)
  Global Optimization (Phase 9)
  Global Optimization (Phase 10)
  Global Optimization (Phase 11)
  Global Optimization (Phase 12)
  Global Optimization (Phase 13)
  Global Optimization (Phase 14)
  Global Optimization (Phase 15)
  Global Optimization (Phase 16)
  Global Optimization (Phase 17)
  Global Optimization (Phase 18)
  Global Optimization (Phase 19)
  Global Optimization (Phase 20)
  Global Optimization (Phase 21)
  Global Optimization (Phase 22)
  Global Optimization (Phase 23)
  Global Optimization (Phase 24)
  Global Optimization (Phase 25)
  Global Optimization (Phase 26)
  Global Optimization (Phase 27)
  Global Optimization (Phase 28)
  Global Optimization (Phase 29)

  Beginning Isolate Ports
  -----------------------

  Beginning Delay Optimization
  ----------------------------

                                  TOTAL                                                
   ELAPSED            WORST NEG   SETUP    DESIGN                              LEAKAGE 
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT            POWER  
  --------- --------- --------- --------- --------- ------------------------- ---------
    0:00:04     329.2      0.00       0.0       0.0                           1678137.5000
    0:00:04     329.2      0.00       0.0       0.0                           1678137.5000
    0:00:04     329.2      0.00       0.0       0.0                           1678137.5000
    0:00:04     329.2      0.00       0.0       0.0                           1678137.5000

  Beginning WLM Backend Optimization
  --------------------------------------
    0:00:04     327.2      0.00       0.0       0.0                           1656260.5000
    0:00:04     327.2      0.00       0.0       0.0                           1643353.1250
    0:00:04     327.2      0.00       0.0       0.0                           1643353.1250
    0:00:04     327.2      0.00       0.0       0.0                           1643353.1250
    0:00:04     327.2      0.00       0.0       0.0                           1643353.1250
    0:00:04     327.2      0.00       0.0       0.0                           1643353.1250
    0:00:04     327.2      0.00       0.0       0.0                           1643353.1250
    0:00:04     327.2      0.00       0.0       0.0                           1643353.1250
    0:00:04     327.2      0.00       0.0       0.0                           1643353.1250
    0:00:04     327.2      0.00       0.0       0.0                           1643353.1250
    0:00:04     327.2      0.00       0.0       0.0                           1643353.1250
    0:00:04     327.2      0.00       0.0       0.0                           1643353.1250
    0:00:04     327.2      0.00       0.0       0.0                           1643353.1250
    0:00:04     327.2      0.00       0.0       0.0                           1643353.1250
    0:00:04     327.2      0.00       0.0       0.0                           1643353.1250
    0:00:04     327.2      0.00       0.0       0.0                           1643353.1250
    0:00:04     327.2      0.00       0.0       0.0                           1643353.1250
    0:00:04     327.2      0.00       0.0       0.0                           1643353.1250
    0:00:04     327.2      0.00       0.0       0.0                           1643353.1250
    0:00:04     327.2      0.00       0.0       0.0                           1643353.1250
    0:00:04     327.2      0.00       0.0       0.0                           1643353.1250
    0:00:04     327.2      0.00       0.0       0.0                           1643353.1250


  Beginning Leakage Power Optimization  (max_leakage_power 0)
  ------------------------------------

                                  TOTAL                                                
   ELAPSED            WORST NEG   SETUP    DESIGN                              LEAKAGE 
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT            POWER  
  --------- --------- --------- --------- --------- ------------------------- ---------
    0:00:04     327.2      0.00       0.0       0.0                           1643353.1250
  Global Optimization (Phase 30)
  Global Optimization (Phase 31)
  Global Optimization (Phase 32)
  Global Optimization (Phase 33)
  Global Optimization (Phase 34)
  Global Optimization (Phase 35)
  Global Optimization (Phase 36)
  Global Optimization (Phase 37)
  Global Optimization (Phase 38)
  Global Optimization (Phase 39)
  Global Optimization (Phase 40)
  Global Optimization (Phase 41)
  Global Optimization (Phase 42)
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250

                                  TOTAL                                                
   ELAPSED            WORST NEG   SETUP    DESIGN                              LEAKAGE 
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT            POWER  
  --------- --------- --------- --------- --------- ------------------------- ---------
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250
    0:00:04     326.4      0.00       0.0       0.0                           1571339.6250
Loading db file '/home/IC/Desktop/DC_labs/ref/libs/mw_lib/sc/LM/sc_max.db'
Loading db file '/opt/Foundary_Library/TSMC90/aci/sc-x/synopsys/fast.db'
Loading db file '/opt/Foundary_Library/TSMC90/aci/sc-x/synopsys/fast_leakage.db'
Loading db file '/opt/Foundary_Library/TSMC90/aci/sc-x/synopsys/fastz.db'
Loading db file '/opt/Foundary_Library/TSMC90/aci/sc-x/synopsys/slow.db'
Loading db file '/opt/Foundary_Library/TSMC90/aci/sc-x/synopsys/typical.db'
Loading db file '/opt/Foundary_Library/TSMC90/aci/sc-x/synopsys/typical_leakage.db'


Note: Symbol # after min delay cost means estimated hold TNS across all active scenarios 


  Optimization Complete
  ---------------------
Information: State dependent leakage is now switched from off to on.
Information: Propagating switching activity (low effort zero delay simulation). (PWR-6)
1
dc_shell> writ
write                         write_library                 write_saif                    
write_app_var                 write_link_library            write_scan_def                
write_bsd_rtl                 write_makefile                write_script                  
write_bsdl                    write_milkyway                write_sdc                     
write_compile_script          write_mw_lib_files            write_sdf                     
write_design_lib_paths        write_parasitics              write_test                    
write_environment             write_partition               write_test_model              
write_file                    write_partition_constraints   write_test_protocol           
write_lib                     write_qtm_model               write_tmax_library            
write_lib_specification_model write_rtl_load                
dc_shell> write_script -out scripts/MY_DESIGN.sdc
1
dc_shell> write -format ddc -hier -out unmapped/MY_DESIGN.ddc
Writing ddc file 'unmapped/MY_DESIGN.ddc'.
1
dc_shell> write -format verilog -hier -out unmapped/MY_DESIGN.v
Writing verilog file '/home/IC/Desktop/DC_labs/lab3/unmapped/MY_DESIGN.v'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
1
dc_shell> exit

Memory usage for main task 370 Mbytes.
Memory usage for this session 370 Mbytes.
CPU usage for this session 11 seconds ( 0.00 hours ).

Thank you...

